Revit 2024 API
ProjectLocationSet.Erase Method
Removes a specified project location from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	ProjectLocation item
)
Visual Basic
Public Overridable Function Erase ( _
	item As ProjectLocation _
) As Integer
Visual C++
public:
virtual int Erase(
	ProjectLocation^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ProjectLocation
The project location to be erased.
Return Value
The number of project locations that were erased from the set.
See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace